{
    "python": "Absolutely not! Haven't you heard of the GIL?!",
    "javascript": "It is neither coffee nor a movie script so it can never be web scale.",
    "javascrip": "Nope. The t is needed for web scale.",
    "cloud": "The cloud has thunderclouds and thunderclouds have rain and rain is never web scale.",
    "java": "Coffee <em>is</em> web scale, but Java is lame. Ipso facto, it is not web scale.",
    "php": "Just because it powers like 80% of the internet doesn't mean it's web scale!",
    "rust": "Yes, but only because of WASM.",
    "venture capitalists": "The only thing that can't be fixed with money is morals.",
    "venture capital": "Money is the original web scale.",
    "go": "If Google made it it should be web scale. However, I can't Google 'go' without getting results from that blasted game so it must not be.",
    "kubernetes": "YAML files are never web scale.",
    "crypto": "Making your own fiat currency <em>thinks</em> it's web scale.",
    "bitcoin": "No.",
    "sbf": "Defrauding investors of billions of dollars is definitely... neat, but it isn't web scale.",
    "bezos": "Bezos begat Amazon begat AWS begat lambdas and lambdas are hella web scale.",
    "musk": "Egomaniacal narcissists spend all their time and energy trying to be web scale.",
    "steve jobs": "Black turtle necks are never web scale.",
    "mongodb": "Duh. It's the original web scale.",
    "assembly": "Hardcode web scale.",
    "ruby": "Elegant code != web scale",
    "nim": "A silly name automatically prevents the scaling of the web.",
    "mastodon": "Fediverse == web scale",
    "postgres": "A database not owned by our robot overlords at Oracle can never be web scale.",
    "oracle": "A database that isn't truly open source can never be web scale.",
    "npm": "You get some front-end JavaScript! You get some back-end JavaScript! Unfortunately, no one gets web scale.",
    "django": "Why don't you just use Flask? Then you'd be web scale.",
    "flask": "Why don't you just use Django? Then you'd be web scale.",
    "rails": "'We don't talk about politics at work unless I talk about politics at work!' is not web scale.",
    "ror": "Maybe the best acronym for a web framework, but 'Ruby is slow', so it's not web scale."
}
